app/Controllers/Profil.php

SELECT *
FROM `users`
WHERE `users`.`id` = '27'
---
    public function __construct()
    {
        $this->categories = (new \Config\AdtConfig())->getCategories();
        $this->sess = session();
        $this->curUser = $this->sess->get('currentuser');
        $this->tweetMdl = new TweetModel();
        $this->userMdl = new UserModel();
        $this->profile = $this->userMdl->find($this->curUser['userid']);

SELECT *
FROM `users`
WHERE `id` = '27'
 LIMIT 1
---
    public function ubahprofil($id)
    {
        $cekid = $this->userMdl->where('id', $id)->first();