app/Controllers/Tweet.php

SELECT *
FROM `likes`
WHERE `tweet_id` = '143'
AND `user_id` = '1'
 LIMIT 1
---
    public function addLike($tweet_id, $user_id)
    {
        $user_id = $this->curUser['userid'];
        $cekid = $this->likesMdl->where('tweet_id', $tweet_id)
            ->where('user_id', $user_id)
            ->first();