app/Controllers/Tweet.php

SELECT *
FROM `users`
WHERE `users`.`id` = '21'
---
    public function __construct()
    {
        $this->categories = (new \Config\AdtConfig())->getCategories();
        $this->sess = session();
        $this->curUser = $this->sess->get('currentuser');
        $this->likesMdl = new LikeModel();
        $this->komenMdl = new KomenModel();
        $this->tweetMdl = new TweetModel();
        $this->RepMdl = new ReplyModel();
        $userMdl = new \App\Models\UserModel();
        $this->profile = $userMdl->find($this->curUser['userid']);

SELECT *
FROM `likes`
WHERE `tweet_id` = '146'
AND `user_id` = '21'
 LIMIT 1
---
    public function addLike($tweet_id, $user_id)
    {
        $user_id = $this->curUser['userid'];
        $cekid = $this->likesMdl->where('tweet_id', $tweet_id)
            ->where('user_id', $user_id)
            ->first();

SELECT *
FROM `komens`
WHERE `id` = '6'
 LIMIT 1
---
    public function addReply($komens_id)
    {
        $komens_id = $this->komenMdl->where('id', $komens_id)->first();