app/Models/KomenModel.php

    public function addKomen($user_id, $komen, $tweet_id)
    {
        $data = [
            'user_id' => $user_id,
            'komentar' => $komen,
            'tweet_id' => $tweet_id
        ];

        $this->insert($data);
---
INSERT INTO `komens` (`user_id`, `komentar`, `tweet_id`) VALUES ('32', ('pelan pelan pak sopir'), '146')

    public function komenCount($tweet_id)
    {
        return $this->where('tweet_id', $tweet_id)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `komens`
WHERE `tweet_id` = '146'

    public function getKomentarByTweetId($tweet_id)
    {
        $query = $this->select('komentar, komens.id, users.username,users.fotoprofil, users.fullname, users.id as user_id')
            ->where('tweet_id', $tweet_id)
            ->join('users', 'users.id = komens.user_id')
            ->findAll();
---
SELECT `komentar`, `komens`.`id`, `users`.`username`, `users`.`fotoprofil`, `users`.`fullname`, `users`.`id` as `user_id`
FROM `komens`
JOIN `users` ON `users`.`id` = `komens`.`user_id`
WHERE `tweet_id` = '146'