app/Models/LikeModel.php

INSERT INTO `likes` (`tweet_id`, `user_id`) VALUES ('146', '21')
---
    public function addLike($tweet_id, $user_id)
    {
        $data = [
            'tweet_id' => $tweet_id,
            'user_id' => $user_id
        ];
       $this->save($data);

SELECT COUNT(*) AS `numrows`
FROM `likes`
WHERE `tweet_id` = '146'
---
    public function getLikeCount($tweet_id)
    {
        return $this->where('tweet_id', $tweet_id)
            ->countAllResults();

SELECT `likes`.`id`, `users`.`username`, `users`.`fotoprofil`, `users`.`fullname`, `users`.`id` as `user_id`
FROM `likes`
JOIN `users` ON `users`.`id` = `likes`.`user_id`
WHERE `tweet_id` = '146'
---
    public function LikebyIdTwt($tweet_id)
    {
        $query = $this->select('likes.id, users.username,users.fotoprofil, users.fullname, users.id as user_id')
            ->where('tweet_id', $tweet_id)
            ->join('users', 'users.id = likes.user_id')
            ->findAll();