app/Models/ReplyModel.php

INSERT INTO `reply` (`user_id`, `replies`, `komens_id`) VALUES ('21', ('baik pakkk'), '6')
---
    public function addReply($user_id, $replies, $komens_id)
    {
        $data = [
            'user_id' => $user_id,
            'replies' => $replies,
            'komens_id' => $komens_id
        ];
        $this->insert($data);

SELECT `replies`, `reply`.`id`, `users`.`username`, `users`.`fotoprofil`, `users`.`fullname`, `users`.`id` as `user_id`
FROM `reply`
JOIN `users` ON `users`.`id` = `reply`.`user_id`
WHERE `komens_id` = '6'
---
    public function getReplyByIdKomen($komen_id)
    {
        $query = $this->select('replies, reply.id, users.username, users.fotoprofil, users.fullname, users.id as user_id')
            ->where('komens_id', $komen_id)
            ->join('users', 'users.id = reply.user_id')
            ->findAll();