app/Models/TweetModel.php

    public function newTweet($curUser, $post)
    {
        $tweets = new \App\Entities\Tweet();
        $tweets->user_id = $curUser['userid'];
        $tweets->content = $post['content'];
        $tweets->category = $post['category'];
        $this->save($tweets);
---
INSERT INTO `tweets` (`user_id`, `content`, `category`, `created_at`, `updated_at`) VALUES ('4', 'sss', 'pendidikan', '2023-07-03 22:55:35', '2023-07-03 22:55:35')