app/Models/TweetModel.php

    public function newTweet($curUser, $post)
    {
        $tweets = new Tweet();
        $tweets->user_id = $curUser['userid'];
        $tweets->content = $post['content'];
        $tweets->category = $post['category'];
        $tweets->fototweet = $post['fototweet'];
        $this->save($tweets);
---
INSERT INTO `tweets` (`user_id`, `content`, `category`, `fototweet`, `created_at`, `updated_at`) VALUES ('21', 'oiya kahh', 'pendidikan', NULL, '2023-07-04 19:38:34', '2023-07-04 19:38:34')

    public function getByCategory($category)
    {
        $category = $this->escapeString($category);
        $query = $this->select('tweets.id, user_id, username, fotoprofil, fullname, content, fototweet, category, created_at, updated_at')
            ->where('category', $category)->orderBy('updated_at', 'desc')
            ->join('users', 'users.id = tweets.user_id');
        return $query->findAll();
---
SELECT `tweets`.`id`, `user_id`, `username`, `fotoprofil`, `fullname`, `content`, `fototweet`, `category`, `created_at`, `updated_at`
FROM `tweets`
JOIN `users` ON `users`.`id` = `tweets`.`user_id`
WHERE `category` = 'teknologi'
ORDER BY `updated_at` DESC

    public function detailbyId($id)
    {
        $id = $this->escapeString($id);
        $query = $this->select('tweets.id, user_id, username, fotoprofil, fullname, fototweet, content, category, created_at')
            ->where('tweets.id', $id)
            ->join('users', 'users.id = tweets.user_id');
        return $query->where('tweets.id', $id)->first();
---
SELECT `tweets`.`id`, `user_id`, `username`, `fotoprofil`, `fullname`, `fototweet`, `content`, `category`, `created_at`
FROM `tweets`
JOIN `users` ON `users`.`id` = `tweets`.`user_id`
WHERE `tweets`.`id` = '146'
AND `tweets`.`id` = '146'
 LIMIT 1