app/Models/UserModel.php

    function addUser($data)
    {
        $user = new User();
        $user->username = $data['username'];
        $user->password = $data['password'];
        $user->fullname = $data['fullname'];
        $user->email = $data['email'];
        $this->save($user);
---
INSERT INTO `users` (`username`, `password`, `fullname`, `email`) VALUES ('rizkalagi12', '$2y$10$rIjNUAaIW4r1btOm7IauUuLiIf4nkWjlfi/4mH9Lo16ecKCjsQwj6', 'Rizka baru', 'rizkanugraha33@gmail.com')

    function ubahProfil($id, $data)
    {
        $user = new User();
        $user->password = $data['password'];
        $user->fotoprofil = $data['fotoprofil'];
        return $this->update($id, $data);
---
UPDATE `users` SET `password` = '$2y$10$eoU4YKlSGuQDSB9qh0Os1.5bwrP81k7bH.z5Pvr8xtaYdhQ9yqSW6', `fotoprofil` = '1688286478_ac45d9213fe559f2c501.jpg'
WHERE `users`.`id` IN ('27')

    public function login($username, $password)
    {
        $user = $this->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'gabbyva'
 LIMIT 1